sfjagsf/m-c-x-a-1-7-6/MCXA176_V6.3/app/driver/UartDriver.c
#include "UartDriver.h"

#include <string.h>

#include "fsl_edma.h"
#include "fsl_gpio.h"
#include "fsl_lpuart.h"
#include "fsl_lpuart_edma.h"
#include "peripherals.h"
#include "pin_mux.h"
#include "../../SmartDMA_UART/app_smartdma_lpuart0.h"

#define UART_LINE_ERROR_FLAGS                                                               \
    (kLPUART_RxOverrunFlag | kLPUART_NoiseErrorFlag | kLPUART_FramingErrorFlag |            \
     kLPUART_ParityErrorFlag)
#define UART_EDMA_STALL_SERVICE_LIMIT (500U)

typedef enum
{
    kUartBackendDisabled,
    kUartBackendRs485SharedDma,
    kUartBackendRs232DualDma,
} uart_backend_t;

typedef enum
{
    kUartRxStopped,
    kUartRxReceiving,
    kUartRxFrameReady,
} uart_rx_state_t;

typedef enum
{
    kUartTxIdle,
    kUartTxDma,
    kUartTxDraining,
} uart_tx_state_t;

typedef struct
{
    uint8_t rx[UART_BUFFER_SIZE];
    uint8_t tx[UART_BUFFER_SIZE];
    volatile uart_rx_state_t rxState;
    volatile uart_tx_state_t txState;
    volatile uart_tx_result_t txResult;
    volatile bool rxRestartPending;
    uart_tx_state_t txWatchState;
    uint32_t txWatchPolls;
    volatile size_t rxLength;
    volatile uint32_t errors;
    volatile uart_diagnostics_t diagnostics;
} uart_runtime_t;

typedef struct
{
    uart_backend_t backend;
    LPUART_Type *base;
    IRQn_Type uartIrq;
    uint32_t txDmaChannel;
    uint32_t rxDmaChannel;
    uint32_t txDmaRequest;
    uint32_t rxDmaRequest;
    IRQn_Type txDmaIrq;
    IRQn_Type rxDmaIrq;
    edma_handle_t *sharedDmaHandle;
    edma_handle_t *txDmaHandle;
    edma_handle_t *rxDmaHandle;
    lpuart_edma_handle_t *lpuartEdmaHandle;
    void (*setDirection)(bool transmit);
} uart_port_config_t;

static uart_runtime_t s_uartRuntime[UART_PORT_COUNT];

static void Uart0_SetDirection(bool transmit)
{
    /* U51 ties DE and /RE together: low receives, high transmits. */
    GPIO_PinWrite(BOARD_INITPINS_RS485_EN_GPIO, BOARD_INITPINS_RS485_EN_GPIO_PIN,
                  transmit ? 1U : 0U);
}

/*
 * Hardware ownership is centralized here. Add a generated port by filling one
 * entry; protocol-independent state, buffers and frame ownership need no copy.
 */
static const uart_port_config_t s_uartConfig[UART_PORT_COUNT] = {
    [kUartPort0] = {
        .backend = kUartBackendRs485SharedDma,
        .base = LPUART0,
        .uartIrq = LPUART0_IRQn,
        .txDmaChannel = DMA0_CH0_DMA_CHANNEL,
        .rxDmaChannel = DMA0_CH0_DMA_CHANNEL,
        .txDmaRequest = kDma0RequestLPUART0Tx,
        .rxDmaRequest = kDma0RequestLPUART0Rx,
        .txDmaIrq = DMA_CH0_IRQn,
        .rxDmaIrq = DMA_CH0_IRQn,
        .sharedDmaHandle = &DMA0_CH0_Handle,
        .setDirection = Uart0_SetDirection,
    },
    [kUartPort1] = {
        .backend = kUartBackendRs232DualDma,
        .base = LPUART1,
        .uartIrq = LPUART1_IRQn,
        .txDmaChannel = LPUART1_TX_DMA_CHANNEL,
        .rxDmaChannel = LPUART1_RX_DMA_CHANNEL,
        .txDmaRequest = LPUART1_TX_DMA_REQUEST,
        .rxDmaRequest = LPUART1_RX_DMA_REQUEST,
        .txDmaIrq = DMA_CH5_IRQn,
        .rxDmaIrq = DMA_CH6_IRQn,
        .txDmaHandle = &LPUART1_TX_Handle,
        .rxDmaHandle = &LPUART1_RX_Handle,
        .lpuartEdmaHandle = &LPUART1_LPUART_eDMA_Handle,
    },
    [kUartPort2] = {.backend = kUartBackendDisabled},
    [kUartPort3] = {.backend = kUartBackendDisabled},
};

static bool UartCore_IsValidPort(uart_port_id_t port)
{
    return ((uint32_t)port < UART_PORT_COUNT) &&
           (s_uartConfig[port].backend != kUartBackendDisabled);
}

static void UartCore_SaveStatus(uart_port_id_t port, status_t status)
{
    s_uartRuntime[port].diagnostics.lastDriverStatus = status;
}

static void UartCore_SaveDmaError(uart_port_id_t port, uint32_t channel)
{
    uart_runtime_t *runtime = &s_uartRuntime[port];

    if ((EDMA_GetChannelStatusFlags(DMA0, channel) & kEDMA_ErrorFlag) != 0U)
    {
        runtime->diagnostics.dmaChannelErrors = DMA0->CH[channel].CH_ES;
        runtime->diagnostics.dmaGlobalErrors = EDMA_GetErrorStatusFlags(DMA0);
        runtime->diagnostics.dmaErrorCount++;
    }
}

static void UartCore_ResetRuntime(uart_port_id_t port)
{
    uart_runtime_t *runtime = &s_uartRuntime[port];

    (void)memset(runtime, 0, sizeof(*runtime));
    runtime->rxState = kUartRxStopped;
    runtime->txState = kUartTxIdle;
    runtime->txResult = kUartTxNone;
    runtime->diagnostics.lastRxRemaining = UART_BUFFER_SIZE;
    runtime->diagnostics.lastDriverStatus = kStatus_Success;
}

static void UartCore_EnableUartInterrupts(const uart_port_config_t *config)
{
    LPUART_EnableInterrupts(config->base, kLPUART_IdleLineInterruptEnable |
                                             kLPUART_RxOverrunInterruptEnable |
                                             kLPUART_NoiseErrorInterruptEnable |
                                             kLPUART_FramingErrorInterruptEnable |
                                             kLPUART_ParityErrorInterruptEnable);
}

static void UartCore_StopSharedDma(uart_port_id_t port)
{
    const uart_port_config_t *config = &s_uartConfig[port];

    UartCore_SaveDmaError(port, config->rxDmaChannel);
    LPUART_EnableTxDMA(config->base, false);
    LPUART_EnableRxDMA(config->base, false);
    EDMA_AbortTransfer(config->sharedDmaHandle);
    EDMA_ClearChannelStatusFlags(DMA0, config->rxDmaChannel,
                                 (uint32_t)kEDMA_DoneFlag | (uint32_t)kEDMA_ErrorFlag |
                                     (uint32_t)kEDMA_InterruptFlag);
    EDMA_SetChannelMux(DMA0, config->rxDmaChannel, kDma0RequestDisabled);
}

static status_t UartCore_StartSharedReceive(uart_port_id_t port)
{
    const uart_port_config_t *config = &s_uartConfig[port];
    uart_runtime_t *runtime = &s_uartRuntime[port];
    edma_transfer_config_t transfer;
    status_t status;

    UartCore_StopSharedDma(port);
    config->setDirection(false);
    LPUART_ClearStatusFlags(config->base, kLPUART_IdleLineFlag);
    EDMA_PrepareTransferConfig(&transfer, (void *)LPUART_GetDataRegisterAddress(config->base),
                               1U << kEDMA_TransferSize1Bytes, 0, runtime->rx,
                               1U << kEDMA_TransferSize1Bytes, 1, 1U, UART_BUFFER_SIZE);
    status = EDMA_SubmitTransfer(config->sharedDmaHandle, &transfer);
    if (status != kStatus_Success)
    {
        runtime->rxState = kUartRxStopped;
        runtime->rxRestartPending = true;
        UartCore_SaveStatus(port, status);
        return status;
    }

    runtime->rxLength = 0U;
    runtime->rxState = kUartRxReceiving;
    runtime->rxRestartPending = false;
    EDMA_SetChannelMux(DMA0, config->rxDmaChannel, config->rxDmaRequest);
    EDMA_EnableChannelInterrupts(DMA0, config->rxDmaChannel, kEDMA_ErrorInterruptEnable);
    EDMA_StartTransfer(config->sharedDmaHandle);
    LPUART_EnableRxDMA(config->base, true);
    UartCore_SaveStatus(port, kStatus_Success);
    return kStatus_Success;
}

