sfjagsf/m-c-x-a-1-7-6/MCXA176_V6.3/app/driver/UartDriver.c
static status_t UartCore_StartDualReceive(uart_port_id_t port)
{
    const uart_port_config_t *config = &s_uartConfig[port];
    uart_runtime_t *runtime = &s_uartRuntime[port];
    lpuart_transfer_t transfer = {
        .rxData = runtime->rx,
        .dataSize = UART_BUFFER_SIZE,
    };
    status_t status;

    LPUART_ClearStatusFlags(config->base, kLPUART_IdleLineFlag);
    runtime->rxLength = 0U;
    runtime->rxState = kUartRxReceiving;
    status = LPUART_ReceiveEDMA(config->base, config->lpuartEdmaHandle, &transfer);
    if (status != kStatus_Success)
    {
        /* NXP sets rxState busy before TCD submission; abort resets it. */
        LPUART_TransferAbortReceiveEDMA(config->base, config->lpuartEdmaHandle);
        runtime->rxState = kUartRxStopped;
        runtime->rxRestartPending = true;
        UartCore_SaveDmaError(port, config->rxDmaChannel);
    }
    UartCore_SaveStatus(port, status);
    if (status == kStatus_Success) runtime->rxRestartPending = false;
    return status;
}

static status_t UartCore_StartReceiveInternal(uart_port_id_t port)
{
    const uart_port_config_t *config = &s_uartConfig[port];

    if (config->backend == kUartBackendRs485SharedDma)
    {
        return UartCore_StartSharedReceive(port);
    }
    return UartCore_StartDualReceive(port);
}

static status_t UartCore_StartSharedTransmit(uart_port_id_t port, size_t size, bool replying)
{
    const uart_port_config_t *config = &s_uartConfig[port];
    uart_runtime_t *runtime = &s_uartRuntime[port];
    edma_transfer_config_t transfer;
    status_t status;

    UartCore_StopSharedDma(port);
    runtime->rxState = kUartRxStopped;
    config->setDirection(true);
    EDMA_PrepareTransferConfig(&transfer, runtime->tx, 1U << kEDMA_TransferSize1Bytes, 1,
                               (void *)LPUART_GetDataRegisterAddress(config->base),
                               1U << kEDMA_TransferSize1Bytes, 0, 1U, (uint32_t)size);
    status = EDMA_SubmitTransfer(config->sharedDmaHandle, &transfer);
    if (status != kStatus_Success)
    {
        config->setDirection(false);
        runtime->txState = kUartTxIdle;
        runtime->txResult = kUartTxFailed;
        UartCore_SaveStatus(port, status);
        if (replying)
        {
            /* The completed RX frame is still valid and can be retried/released. */
            runtime->rxState = kUartRxFrameReady;
        }
        else
        {
            (void)UartCore_StartReceiveInternal(port);
        }
        UartCore_SaveStatus(port, status);
        return status;
    }

    runtime->txState = kUartTxDma;
    EDMA_SetChannelMux(DMA0, config->txDmaChannel, config->txDmaRequest);
    EDMA_EnableChannelInterrupts(DMA0, config->txDmaChannel, kEDMA_ErrorInterruptEnable);
    EDMA_StartTransfer(config->sharedDmaHandle);
    LPUART_EnableTxDMA(config->base, true);
    UartCore_SaveStatus(port, kStatus_Success);
    return kStatus_Success;
}

static status_t UartCore_StartDualTransmit(uart_port_id_t port, size_t size)
{
    const uart_port_config_t *config = &s_uartConfig[port];
    uart_runtime_t *runtime = &s_uartRuntime[port];
    lpuart_transfer_t transfer = {
        .txData = runtime->tx,
        .dataSize = size,
    };
    status_t status;

    runtime->txState = kUartTxDma;
    status = LPUART_SendEDMA(config->base, config->lpuartEdmaHandle, &transfer);
    if (status != kStatus_Success)
    {
        /* NXP sets txState busy before TCD submission; abort resets it. */
        LPUART_TransferAbortSendEDMA(config->base, config->lpuartEdmaHandle);
        runtime->txState = kUartTxIdle;
        runtime->txResult = kUartTxFailed;
        UartCore_SaveDmaError(port, config->txDmaChannel);
    }
    UartCore_SaveStatus(port, status);
    return status;
}

static status_t UartCore_StartTransmit(uart_port_id_t port, const uint8_t *data, size_t size,
                                       bool replying)
{
    const uart_port_config_t *config = &s_uartConfig[port];
    uart_runtime_t *runtime = &s_uartRuntime[port];
    uint32_t irqMask;

    if ((data == NULL) || (size == 0U) || (size > UART_BUFFER_SIZE))
    {
        return kStatus_InvalidArgument;
    }
    /* Atomically reserve TX; DMA setup itself remains outside the critical section. */
    irqMask = DisableGlobalIRQ();
    if ((runtime->txState != kUartTxIdle) ||
        (!replying && (config->backend == kUartBackendRs485SharedDma) &&
         (runtime->rxState == kUartRxFrameReady)))
    {
        EnableGlobalIRQ(irqMask);
        return kStatus_Busy;
    }
    runtime->txState = kUartTxDma;
    runtime->txResult = kUartTxPending;
    if (config->backend == kUartBackendRs485SharedDma)
    {
        /* Reserving the half-duplex bus invalidates the active RX transaction. */
        runtime->rxState = kUartRxStopped;
    }
    EnableGlobalIRQ(irqMask);

    (void)memcpy(runtime->tx, data, size);
    if (config->backend == kUartBackendRs485SharedDma)
    {
        return UartCore_StartSharedTransmit(port, size, replying);
    }
    return UartCore_StartDualTransmit(port, size);
}

static void UartCore_FinishSharedReceive(uart_port_id_t port)
{
    const uart_port_config_t *config = &s_uartConfig[port];
    uart_runtime_t *runtime = &s_uartRuntime[port];
    const uint32_t remaining =
        EDMA_GetRemainingMajorLoopCount(DMA0, config->rxDmaChannel);

    runtime->diagnostics.lastRxRemaining = remaining;
    UartCore_StopSharedDma(port);
    runtime->rxLength = UART_BUFFER_SIZE - remaining;
    runtime->diagnostics.lastRxLength = (uint32_t)runtime->rxLength;
    runtime->rxState = (runtime->rxLength != 0U) ? kUartRxFrameReady : kUartRxStopped;
    if (runtime->rxState == kUartRxStopped)
    {
        (void)UartCore_StartReceiveInternal(port);
    }
}

static void UartCore_FinishDualReceive(uart_port_id_t port)
{
    const uart_port_config_t *config = &s_uartConfig[port];
    uart_runtime_t *runtime = &s_uartRuntime[port];
    uint32_t count = 0U;
    const status_t status =
        LPUART_TransferGetReceiveCountEDMA(config->base, config->lpuartEdmaHandle, &count);

    if (status != kStatus_Success)
    {
        LPUART_TransferAbortReceiveEDMA(config->base, config->lpuartEdmaHandle);
        runtime->rxState = kUartRxStopped;
        runtime->rxLength = 0U;
        runtime->rxRestartPending = true;
        runtime->diagnostics.discardedFrameCount++;
        UartCore_SaveStatus(port, status);
        /* Service retries from kUartRxStopped outside the IRQ. */
        return;
    }

    LPUART_TransferAbortReceiveEDMA(config->base, config->lpuartEdmaHandle);
    runtime->rxLength = (size_t)count;
    runtime->diagnostics.lastRxLength = count;
    runtime->diagnostics.lastRxRemaining = UART_BUFFER_SIZE - count;
    runtime->rxState = (count != 0U) ? kUartRxFrameReady : kUartRxStopped;
    if (runtime->rxState == kUartRxStopped)
    {
        (void)UartCore_StartReceiveInternal(port);
    }
}

static void UartCore_CompleteSharedTransmit(uart_port_id_t port)
{
    const uart_port_config_t *config = &s_uartConfig[port];
    uart_runtime_t *runtime = &s_uartRuntime[port];

