sfjagsf/m-c-x-a-1-7-6/MCXA176_V6.3/app/driver/UartDriver.c
    if (runtime->txState != kUartTxDraining)
    {
        return;
    }

    LPUART_DisableInterrupts(config->base, kLPUART_TransmissionCompleteInterruptEnable);
    config->setDirection(false);
    runtime->txState = kUartTxIdle;
    runtime->txResult = kUartTxComplete;
    UartCore_SaveStatus(port, UartCore_StartReceiveInternal(port));
}

static bool UartCore_SaveAndClearLineErrors(uart_port_id_t port, uint32_t flags)
{
    const uint32_t errors = flags & UART_LINE_ERROR_FLAGS;
    uart_runtime_t *runtime = &s_uartRuntime[port];

    if (errors == 0U)
    {
        return false;
    }

    LPUART_ClearStatusFlags(s_uartConfig[port].base, errors);
    runtime->errors |= errors;
    runtime->diagnostics.uartErrors |= errors;
    runtime->diagnostics.uartErrorCount++;
    return true;
}

static void UartCore_RecoverReceiveError(uart_port_id_t port)
{
    const uart_port_config_t *config = &s_uartConfig[port];
    uart_runtime_t *runtime = &s_uartRuntime[port];

    if (config->backend == kUartBackendRs485SharedDma)
    {
        UartCore_StopSharedDma(port);
        config->setDirection(false);
    }
    else
    {
        LPUART_TransferAbortReceiveEDMA(config->base, config->lpuartEdmaHandle);
    }
    runtime->rxState = kUartRxStopped;
    runtime->rxLength = 0U;
    runtime->diagnostics.discardedFrameCount++;
    UartCore_SaveStatus(port, UartCore_StartReceiveInternal(port));
}

static void UartCore_HandleUartIrq(uart_port_id_t port)
{
    const uart_port_config_t *config = &s_uartConfig[port];
    uart_runtime_t *runtime = &s_uartRuntime[port];
    const uint32_t flags = LPUART_GetStatusFlags(config->base);
    const bool lineError = UartCore_SaveAndClearLineErrors(port, flags);

    if (lineError && (runtime->rxState == kUartRxReceiving))
    {
        UartCore_RecoverReceiveError(port);
    }
    else if (((flags & kLPUART_IdleLineFlag) != 0U) &&
             (runtime->rxState == kUartRxReceiving))
    {
        LPUART_ClearStatusFlags(config->base, kLPUART_IdleLineFlag);
        if (config->backend == kUartBackendRs485SharedDma)
        {
            UartCore_FinishSharedReceive(port);
        }
        else
        {
            UartCore_FinishDualReceive(port);
        }
    }
    else if ((flags & kLPUART_IdleLineFlag) != 0U)
    {
        LPUART_ClearStatusFlags(config->base, kLPUART_IdleLineFlag);
    }

    if (config->backend == kUartBackendRs485SharedDma)
    {
        if (((flags & kLPUART_TransmissionCompleteFlag) != 0U) &&
            (runtime->txState == kUartTxDraining))
        {
            UartCore_CompleteSharedTransmit(port);
        }
    }
    else if (((flags & kLPUART_TransmissionCompleteFlag) != 0U) &&
             ((config->base->CTRL & LPUART_CTRL_TCIE_MASK) != 0U))
    {
        /* Continue NXP's eDMA TX chain; this produces kStatus_LPUART_TxIdle. */
        LPUART_TransferEdmaHandleIRQ(config->base, config->lpuartEdmaHandle);
    }
}

static void UartCore_HandleSharedDmaDone(uart_port_id_t port, bool transferDone)
{
    const uart_port_config_t *config = &s_uartConfig[port];
    uart_runtime_t *runtime = &s_uartRuntime[port];

    if (!transferDone)
    {
        return;
    }

    if (runtime->txState == kUartTxDma)
    {
        LPUART_EnableTxDMA(config->base, false);
        EDMA_SetChannelMux(DMA0, config->txDmaChannel, kDma0RequestDisabled);
        runtime->txState = kUartTxDraining;
        if ((LPUART_GetStatusFlags(config->base) & kLPUART_TransmissionCompleteFlag) != 0U)
        {
            UartCore_CompleteSharedTransmit(port);
        }
        else
        {
            LPUART_EnableInterrupts(config->base,
                                    kLPUART_TransmissionCompleteInterruptEnable);
        }
    }
    else if (runtime->rxState == kUartRxReceiving)
    {
        LPUART_EnableRxDMA(config->base, false);
        EDMA_SetChannelMux(DMA0, config->rxDmaChannel, kDma0RequestDisabled);
        runtime->rxLength = UART_BUFFER_SIZE;
        runtime->rxState = kUartRxFrameReady;
        runtime->diagnostics.lastRxRemaining = 0U;
        runtime->diagnostics.lastRxLength = UART_BUFFER_SIZE;
    }
}

static void UartCore_HandleDualDmaCallback(uart_port_id_t port, status_t status)
{
    uart_runtime_t *runtime = &s_uartRuntime[port];

    UartCore_SaveStatus(port, status);
    if (status == kStatus_LPUART_TxIdle)
    {
        runtime->txState = kUartTxIdle;
        runtime->txResult = kUartTxComplete;
    }
    else if (status == kStatus_LPUART_RxIdle)
    {
        runtime->rxLength = UART_BUFFER_SIZE;
        runtime->rxState = kUartRxFrameReady;
        runtime->diagnostics.lastRxRemaining = 0U;
        runtime->diagnostics.lastRxLength = UART_BUFFER_SIZE;
    }
}

static void UartCore_HandleSharedDmaIrq(uart_port_id_t port)
{
    const uart_port_config_t *config = &s_uartConfig[port];
    uart_runtime_t *runtime = &s_uartRuntime[port];

    if ((EDMA_GetChannelStatusFlags(DMA0, config->rxDmaChannel) & kEDMA_ErrorFlag) != 0U)
    {
        if (runtime->rxState == kUartRxReceiving)
        {
            runtime->diagnostics.discardedFrameCount++;
        }
        /* StopSharedDma records the channel error once before clearing it. */
        UartCore_StopSharedDma(port);
        LPUART_DisableInterrupts(config->base, kLPUART_TransmissionCompleteInterruptEnable);
        config->setDirection(false);
        runtime->rxState = kUartRxStopped;
        runtime->txState = kUartTxIdle;
        if (runtime->txResult == kUartTxPending) runtime->txResult = kUartTxFailed;
        runtime->rxLength = 0U;
        UartCore_SaveStatus(port, UartCore_StartReceiveInternal(port));
    }
    else
    {
        EDMA_HandleIRQ(config->sharedDmaHandle);
    }
}

static void UartCore_HandleDualDmaIrq(uart_port_id_t port, bool isTx)
{
    const uart_port_config_t *config = &s_uartConfig[port];
    uart_runtime_t *runtime = &s_uartRuntime[port];
    const uint32_t channel = isTx ? config->txDmaChannel : config->rxDmaChannel;
    edma_handle_t *handle = isTx ? config->txDmaHandle : config->rxDmaHandle;

    if ((EDMA_GetChannelStatusFlags(DMA0, channel) & kEDMA_ErrorFlag) == 0U)
    {
        EDMA_HandleIRQ(handle);
        return;
    }

    UartCore_SaveDmaError(port, channel);
    if (isTx)
    {
        LPUART_TransferAbortSendEDMA(config->base, config->lpuartEdmaHandle);
        runtime->txState = kUartTxIdle;
        runtime->txResult = kUartTxFailed;
    }
    else
    {
        LPUART_TransferAbortReceiveEDMA(config->base, config->lpuartEdmaHandle);
        runtime->rxState = kUartRxStopped;
        runtime->rxLength = 0U;
        runtime->diagnostics.discardedFrameCount++;
    }
    EDMA_ClearChannelStatusFlags(DMA0, channel,
                                 (uint32_t)kEDMA_DoneFlag | (uint32_t)kEDMA_ErrorFlag |
                                     (uint32_t)kEDMA_InterruptFlag);
    UartCore_SaveStatus(port, kStatus_Fail);
    if (!isTx)
    {
        UartCore_SaveStatus(port, UartCore_StartReceiveInternal(port));
    }
}

