sfjagsf/m-c-x-a-1-7-6/MCXA176_V6.3/app/driver/UartDriver.c
void UartPort_Init(uart_port_id_t port)
{
    const uart_port_config_t *config;

    if (!UartCore_IsValidPort(port))
    {
        return;
    }
    if (port == kUartPort0)
    {
        APP_SmartDMALPUART0_TransportInit();
        return;
    }
    config = &s_uartConfig[port];

    if (config->backend == kUartBackendRs485SharedDma)
    {
        UartCore_StopSharedDma(port);
    }
    else
    {
        LPUART_TransferAbortSendEDMA(config->base, config->lpuartEdmaHandle);
        LPUART_TransferAbortReceiveEDMA(config->base, config->lpuartEdmaHandle);
    }
    LPUART_DisableInterrupts(config->base, kLPUART_AllInterruptEnable);
    LPUART_ClearStatusFlags(config->base, kLPUART_AllClearFlags);
    LPUART_SetRxFifoWatermark(config->base, 0U);
    if (config->setDirection != NULL)
    {
        config->setDirection(false);
    }
    UartCore_ResetRuntime(port);

    NVIC_ClearPendingIRQ(config->uartIrq);
    NVIC_SetPriority(config->uartIrq, 5U);
    EnableIRQ(config->uartIrq);
    if (config->txDmaIrq != config->uartIrq)
    {
        NVIC_SetPriority(config->txDmaIrq, 5U);
        EnableIRQ(config->txDmaIrq);
    }
    if (config->rxDmaIrq != config->txDmaIrq)
    {
        NVIC_SetPriority(config->rxDmaIrq, 5U);
        EnableIRQ(config->rxDmaIrq);
    }
    UartCore_EnableUartInterrupts(config);
    UartCore_SaveStatus(port, UartCore_StartReceiveInternal(port));
}

status_t UartPort_StartReceive(uart_port_id_t port)
{
    if (port == kUartPort0)
    {
        return APP_SmartDMALPUART0_StartReceive();
    }
    if (!UartCore_IsValidPort(port))
    {
        return kStatus_Fail;
    }
    if (s_uartRuntime[port].rxState != kUartRxStopped)
    {
        return kStatus_Busy;
    }
    return UartCore_StartReceiveInternal(port);
}

status_t UartPort_Send(uart_port_id_t port, const uint8_t *data, size_t size)
{
    if (port == kUartPort0)
    {
        return APP_SmartDMALPUART0_Send(data, size, false);
    }
    if (!UartCore_IsValidPort(port))
    {
        return kStatus_Fail;
    }
    return UartCore_StartTransmit(port, data, size, false);
}

status_t UartPort_Reply(uart_port_id_t port, const uint8_t *data, size_t size)
{
    status_t status;

    if (!UartCore_IsValidPort(port))
    {
        return kStatus_Fail;
    }
    if (port == kUartPort0)
    {
        if (!APP_SmartDMALPUART0_IsFrameAvailable())
        {
            return kStatus_NoTransferInProgress;
        }
        return APP_SmartDMALPUART0_Send(data, size, true);
    }
    if (s_uartRuntime[port].rxState != kUartRxFrameReady)
    {
        return kStatus_NoTransferInProgress;
    }

    status = UartCore_StartTransmit(port, data, size, true);
    if (status != kStatus_Success)
    {
        return status;
    }

    if (s_uartConfig[port].backend == kUartBackendRs485SharedDma)
    {
        /* TC completion restarts shared-channel RX. */
        s_uartRuntime[port].rxState = kUartRxStopped;
    }
    else
    {
        const status_t rxStatus = UartCore_StartReceiveInternal(port);
        if (rxStatus != kStatus_Success)
        {
            /* Reply already owns a TX copy; old RX storage is no longer valid.
             * Keep RX stopped so UartPort_Service can retry. */
            s_uartRuntime[port].rxState = kUartRxStopped;
        }
    }
    return status;
}

void UartPort_Abort(uart_port_id_t port)
{
    const uart_port_config_t *config;

    if (!UartCore_IsValidPort(port))
    {
        return;
    }
    if (port == kUartPort0)
    {
        APP_SmartDMALPUART0_Abort();
        return;
    }
    config = &s_uartConfig[port];
    if (s_uartRuntime[port].txResult == kUartTxPending)
    {
        s_uartRuntime[port].txResult = kUartTxFailed;
    }
    if (config->backend == kUartBackendRs485SharedDma)
    {
        UartCore_StopSharedDma(port);
        LPUART_DisableInterrupts(config->base, kLPUART_TransmissionCompleteInterruptEnable);
        config->setDirection(false);
    }
    else
    {
        LPUART_TransferAbortSendEDMA(config->base, config->lpuartEdmaHandle);
        LPUART_TransferAbortReceiveEDMA(config->base, config->lpuartEdmaHandle);
    }
    s_uartRuntime[port].rxState = kUartRxStopped;
    s_uartRuntime[port].txState = kUartTxIdle;
    s_uartRuntime[port].rxLength = 0U;
    s_uartRuntime[port].rxRestartPending = false;
}

status_t UartPort_AbortAndReceive(uart_port_id_t port)
{
    if (!UartCore_IsValidPort(port)) return kStatus_Fail;
    if (port == kUartPort0 && !APP_SmartDMALPUART0_IsInitialized()) return kStatus_Fail;
    UartPort_Abort(port);
    /* SmartDMA abort is asynchronous; its service restarts RX after completion. */
    if (port == kUartPort0) return kStatus_Success;
    return UartPort_StartReceive(port);
}

void UartPort_Service(uart_port_id_t port)
{
    if (port == kUartPort0) APP_SmartDMALPUART0_Service();
    else if (UartCore_IsValidPort(port))
    {
        uart_runtime_t *runtime = &s_uartRuntime[port];

        if (runtime->txState != runtime->txWatchState)
        {
            runtime->txWatchState = runtime->txState;
            runtime->txWatchPolls = 0U;
        }
        else if (runtime->txState != kUartTxIdle &&
                 ++runtime->txWatchPolls >= UART_EDMA_STALL_SERVICE_LIMIT)
        {
            const uart_tx_state_t timedOutState = runtime->txState;
            runtime->txWatchPolls = 0U;
            if (runtime->txState == timedOutState)
            {
                (void)UartPort_AbortAndReceive(port);
                UartCore_SaveStatus(port, kStatus_Timeout);
            }
        }
        if (runtime->rxRestartPending && runtime->rxState == kUartRxStopped)
        {
            (void)UartCore_StartReceiveInternal(port);
        }
    }
}

uart_tx_result_t UartPort_GetTxResult(uart_port_id_t port)
{
    if (port == kUartPort0)
    {
        switch (APP_SmartDMALPUART0_GetTxResult())
        {
            case kAppSmartDmaTxPending: return kUartTxPending;
            case kAppSmartDmaTxComplete: return kUartTxComplete;
            case kAppSmartDmaTxFailed: return kUartTxFailed;
            default: return kUartTxNone;
        }
    }
    return UartCore_IsValidPort(port) ? s_uartRuntime[port].txResult : kUartTxNone;
}

