sfjagsf/m-c-x-a-1-7-6/MCXA176_V6.3/app/driver/UartDriver.c
bool UartPort_IsBusy(uart_port_id_t port)
{
    if (port == kUartPort0)
    {
        return APP_SmartDMALPUART0_IsBusy();
    }
    return UartCore_IsValidPort(port) && (s_uartRuntime[port].txState != kUartTxIdle);
}

bool UartPort_IsFrameAvailable(uart_port_id_t port)
{
    if (port == kUartPort0)
    {
        return APP_SmartDMALPUART0_IsFrameAvailable();
    }
    return UartCore_IsValidPort(port) &&
           (s_uartRuntime[port].rxState == kUartRxFrameReady);
}

const uint8_t *UartPort_GetFrame(uart_port_id_t port, size_t *length)
{
    if (port == kUartPort0)
    {
        return APP_SmartDMALPUART0_GetFrame(length);
    }
    if (length != NULL)
    {
        *length = UartPort_IsFrameAvailable(port) ? s_uartRuntime[port].rxLength : 0U;
    }
    return UartPort_IsFrameAvailable(port) ? s_uartRuntime[port].rx : NULL;
}

status_t UartPort_ReleaseFrame(uart_port_id_t port)
{
    status_t status;

    if (!UartCore_IsValidPort(port))
    {
        return kStatus_Fail;
    }
    if (port == kUartPort0)
    {
        return APP_SmartDMALPUART0_ReleaseFrame();
    }
    if (s_uartRuntime[port].rxState != kUartRxFrameReady)
    {
        return kStatus_NoTransferInProgress;
    }

    s_uartRuntime[port].rxState = kUartRxStopped;
    status = UartCore_StartReceiveInternal(port);
    if (status != kStatus_Success)
    {
        s_uartRuntime[port].rxState = kUartRxFrameReady;
    }
    return status;
}

uint32_t UartPort_GetAndClearErrors(uart_port_id_t port)
{
    uint32_t errors;
    uint32_t irqMask;

    if (!UartCore_IsValidPort(port))
    {
        return 0U;
    }
    if (port == kUartPort0)
    {
        return APP_SmartDMALPUART0_GetAndClearErrors();
    }
    irqMask = DisableGlobalIRQ();
    errors = s_uartRuntime[port].errors;
    s_uartRuntime[port].errors = 0U;
    EnableGlobalIRQ(irqMask);
    return errors;
}

void UartPort_GetDiagnostics(uart_port_id_t port, uart_diagnostics_t *diagnostics)
{
    uint32_t irqMask;
    const volatile uart_diagnostics_t *source;
    app_smartdma_lpuart0_debug_snapshot_t smartdma;

    if (!UartCore_IsValidPort(port) || (diagnostics == NULL))
    {
        return;
    }
    if (port == kUartPort0)
    {
        APP_SmartDMALPUART0_GetDebugSnapshot(&smartdma);
        (void)memset(diagnostics, 0, sizeof(*diagnostics));
        diagnostics->uartErrors = smartdma.errors;
        diagnostics->uartErrorCount = smartdma.lineErrorCount;
        diagnostics->lastRxRemaining = smartdma.smartdma.rxRemaining;
        diagnostics->lastRxLength = smartdma.lastRxLength;
        diagnostics->lastDriverStatus =
            (APP_SmartDMALPUART0_GetTxResult() == kAppSmartDmaTxFailed) ?
                kStatus_Fail : kStatus_Success;
        return;
    }
    irqMask = DisableGlobalIRQ();
    source = &s_uartRuntime[port].diagnostics;
    diagnostics->uartErrors = source->uartErrors;
    diagnostics->uartErrorCount = source->uartErrorCount;
    diagnostics->dmaChannelErrors = source->dmaChannelErrors;
    diagnostics->dmaGlobalErrors = source->dmaGlobalErrors;
    diagnostics->dmaErrorCount = source->dmaErrorCount;
    diagnostics->discardedFrameCount = source->discardedFrameCount;
    diagnostics->lastRxRemaining = source->lastRxRemaining;
    diagnostics->lastRxLength = source->lastRxLength;
    diagnostics->lastDriverStatus = source->lastDriverStatus;
    EnableGlobalIRQ(irqMask);
}

void UartPort_ClearDiagnostics(uart_port_id_t port)
{
    uint32_t irqMask;

    if (!UartCore_IsValidPort(port))
    {
        return;
    }
    if (port == kUartPort0)
    {
        APP_SmartDMALPUART0_ClearDiagnostics();
        return;
    }
    irqMask = DisableGlobalIRQ();
    (void)memset((void *)&s_uartRuntime[port].diagnostics, 0,
                 sizeof(s_uartRuntime[port].diagnostics));
    s_uartRuntime[port].diagnostics.lastRxRemaining = UART_BUFFER_SIZE;
    s_uartRuntime[port].diagnostics.lastDriverStatus = kStatus_Success;
    EnableGlobalIRQ(irqMask);
}

/* Port-specific API remains thin and contains no hardware policy. */
#define UART_DEFINE_PORT_API(n)                                                              \
    void Uart##n##_Init(void) { UartPort_Init(kUartPort##n); }                               \
    status_t Uart##n##_StartReceive(void) { return UartPort_StartReceive(kUartPort##n); }    \
    status_t Uart##n##_Send(const uint8_t *data, size_t size)                               \
    { return UartPort_Send(kUartPort##n, data, size); }                                      \
    status_t Uart##n##_Reply(const uint8_t *data, size_t size)                              \
    { return UartPort_Reply(kUartPort##n, data, size); }                                     \
    void Uart##n##_Abort(void) { UartPort_Abort(kUartPort##n); }                             \
    bool Uart##n##_IsBusy(void) { return UartPort_IsBusy(kUartPort##n); }                    \
    bool Uart##n##_IsFrameAvailable(void) { return UartPort_IsFrameAvailable(kUartPort##n); } \
    const uint8_t *Uart##n##_GetFrame(size_t *length)                                       \
    { return UartPort_GetFrame(kUartPort##n, length); }                                      \
    status_t Uart##n##_ReleaseFrame(void) { return UartPort_ReleaseFrame(kUartPort##n); }    \
    uint32_t Uart##n##_GetAndClearErrors(void)                                               \
    { return UartPort_GetAndClearErrors(kUartPort##n); }                                     \
    void Uart##n##_GetDiagnostics(uart_diagnostics_t *diagnostics)                          \
    { UartPort_GetDiagnostics(kUartPort##n, diagnostics); }                                 \
    void Uart##n##_ClearDiagnostics(void) { UartPort_ClearDiagnostics(kUartPort##n); }

UART_DEFINE_PORT_API(0)
UART_DEFINE_PORT_API(1)
UART_DEFINE_PORT_API(2)
UART_DEFINE_PORT_API(3)

#undef UART_DEFINE_PORT_API

/* Generated callback entry points are adapters into the common core. */
void LPUART0_DMACallback(edma_handle_t *handle, void *userData, bool transferDone, uint32_t tcds)
{
    (void)handle;
    (void)userData;
    (void)tcds;
    UartCore_HandleSharedDmaDone(kUartPort0, transferDone);
}

void LPUART1_DMACallback(LPUART_Type *base, lpuart_edma_handle_t *handle, status_t status,
                         void *userData)
{
    (void)base;
    (void)handle;
    (void)userData;
    UartCore_HandleDualDmaCallback(kUartPort1, status);
}

void LPUART0_IRQHandler(void)
{
    APP_SmartDMALPUART0_HandleLpuartIrq();
    SDK_ISR_EXIT_BARRIER;
}

void LPUART1_IRQHandler(void)
{
    UartCore_HandleUartIrq(kUartPort1);
    SDK_ISR_EXIT_BARRIER;
}

void DMA_CH0_IRQHandler(void)
{
    UartCore_HandleSharedDmaIrq(kUartPort0);
    SDK_ISR_EXIT_BARRIER;
}

void DMA_CH5_IRQHandler(void)
{
    UartCore_HandleDualDmaIrq(kUartPort1, true);
    SDK_ISR_EXIT_BARRIER;
}

void DMA_CH6_IRQHandler(void)
{
    UartCore_HandleDualDmaIrq(kUartPort1, false);
    SDK_ISR_EXIT_BARRIER;
}
